src/cf/Documents/уатЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаявкаНаРемонт</xr:Item>
				<xr:Item>Document.уатПланированиеРаботыТС</xr:Item>
				<xr:Item>Document.уатРемонтныйЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПланированиеРаботыТС</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКурса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КроссКурс</Name>
					<Comment>Кросс-курс взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>(Общ) Сумма взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбеспечениеПланов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоПлану</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбслуживания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатЗаказыПоставщикам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте Заказа поставщику</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого  учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПлановая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатАналоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатАналоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Главный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/уатЗаказПоставщику/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "УправлениеПечатью";
	КомандаПечати.Идентификатор = "Документ.уатЗаказПоставщику.ПФ_MXL_ЗаказПоставщикуТовары";
	КомандаПечати.Представление = НСтр("ru = 'Заказ поставщику'; en = 'Order to supplier'");
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СвязанныеТовары.Номенклатура КАК Справочник.Номенклатура) КАК НоменклатураФактическая,
	|	ВЫРАЗИТЬ(СвязанныеТовары.Количество КАК ЧИСЛО) КАК Количество,
	|	ВЫРАЗИТЬ(СвязанныеТовары.ID КАК СТРОКА(100)) КАК ID
	|ПОМЕСТИТЬ втСвязанныеТовары
	|ИЗ
	|	&СвязанныеТовары КАК СвязанныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаОстаткиТоваров.Номенклатура КАК Справочник.Номенклатура) КАК НоменклатураФактическая,
	|	ВЫРАЗИТЬ(ТаблицаОстаткиТоваров.Количество КАК ЧИСЛО) КАК Количество
	|ПОМЕСТИТЬ втТоварыСверхПлана
	|ИЗ
	|	&ТаблицаОстаткиТоваров КАК ТаблицаОстаткиТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаПланы.Номенклатура КАК Справочник.Номенклатура) КАК НоменклатураПлановая,
	|	ВЫРАЗИТЬ(ТаблицаПланы.ВидОбслуживания КАК Справочник.уатВидыОбслуживанияТС) КАК ВидОбслуживания,
	|	ТаблицаПланы.ТС КАК ТС,
	|	ВЫРАЗИТЬ(ТаблицаПланы.ID КАК СТРОКА(100)) КАК ID
	|ПОМЕСТИТЬ втПланы
	|ИЗ
	|	&ТаблицаПланы КАК ТаблицаПланы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уатЗаказПоставщику.Организация КАК Организация,
	|	уатЗаказПоставщику.Подразделение КАК Подразделение,
	|	уатЗаказПоставщику.Дата КАК Период,
	|	уатЗаказПоставщику.Ссылка КАК Регистратор,
	|	уатЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	|	уатЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	втСвязанныеТовары.Количество КАК Количество,
	|	втПланы.НоменклатураПлановая КАК НоменклатураПлановая,
	|	ВЫБОР
	|		КОГДА втСвязанныеТовары.Количество = уатЗаказПоставщикуТовары.Количество
	|			ТОГДА уатЗаказПоставщикуТовары.Сумма
	|		КОГДА уатЗаказПоставщикуТовары.Количество = 0
	|			ТОГДА уатЗаказПоставщикуТовары.Сумма
	|		ИНАЧЕ уатЗаказПоставщикуТовары.Сумма * втСвязанныеТовары.Количество / уатЗаказПоставщикуТовары.Количество
	|	КОНЕЦ КАК Сумма,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	уатЗаказПоставщикуТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	уатЗаказПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	|	втПланы.ВидОбслуживания КАК ВидОбслуживания,
	|	втПланы.ТС КАК ТС
	|ИЗ
	|	Документ.уатЗаказПоставщику КАК уатЗаказПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатЗаказПоставщику.Товары КАК уатЗаказПоставщикуТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСвязанныеТовары КАК втСвязанныеТовары
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПланы КАК втПланы
	|				ПО втСвязанныеТовары.ID = втПланы.ID
	|			ПО уатЗаказПоставщикуТовары.Номенклатура = втСвязанныеТовары.НоменклатураФактическая
	|		ПО уатЗаказПоставщику.Ссылка = уатЗаказПоставщикуТовары.Ссылка
	|ГДЕ
	|	уатЗаказПоставщикуТовары.Ссылка = &Ссылка
	|	И втСвязанныеТовары.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатЗаказПоставщику.Организация,
	|	уатЗаказПоставщику.Подразделение,
	|	уатЗаказПоставщику.Дата,
	|	уатЗаказПоставщику.Ссылка,
	|	уатЗаказПоставщику.Ссылка,
	|	уатЗаказПоставщикуТовары.Номенклатура,
	|	втТоварыСверхПлана.Количество,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА втТоварыСверхПлана.Количество = уатЗаказПоставщикуТовары.Количество
	|			ТОГДА уатЗаказПоставщикуТовары.Сумма
	|		КОГДА уатЗаказПоставщикуТовары.Количество = 0
	|			ТОГДА уатЗаказПоставщикуТовары.Сумма
	|		ИНАЧЕ уатЗаказПоставщикуТовары.Сумма * втТоварыСверхПлана.Количество / уатЗаказПоставщикуТовары.Количество
	|	КОНЕЦ,
	|	0,
	|	0,
	|	уатЗаказПоставщикуТовары.ЕдиницаИзмерения,
	|	уатЗаказПоставщикуТовары.НомерСтроки,
	|	Значение(Справочник.уатВидыОбслуживанияТС.ПустаяСсылка),
	|	Неопределено
	|ИЗ
	|	Документ.уатЗаказПоставщику КАК уатЗаказПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатЗаказПоставщику.Товары КАК уатЗаказПоставщикуТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТоварыСверхПлана КАК втТоварыСверхПлана
	|			ПО уатЗаказПоставщикуТовары.Номенклатура = втТоварыСверхПлана.НоменклатураФактическая
	|		ПО уатЗаказПоставщику.Ссылка = уатЗаказПоставщикуТовары.Ссылка
	|ГДЕ
	|	уатЗаказПоставщикуТовары.Ссылка = &Ссылка
	|	И втТоварыСверхПлана.Количество > 0");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ТаблицаПланы", ДополнительныеСвойства.ТаблицаПланы);
	Запрос.УстановитьПараметр("СвязанныеТовары", ДополнительныеСвойства.СвязанныеТовары);
	Запрос.УстановитьПараметр("ТаблицаОстаткиТоваров", ДополнительныеСвойства.ТаблицаОстаткиТоваров);
	ТаблицаЗаказыПоставщику = Запрос.Выполнить().Выгрузить();
	
	// управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатЗаказыПоставщикам");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаЗаказыПоставщику;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация",          "Организация");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение",        "Подразделение");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура",         "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЕдиницаИзмерения",     "ЕдиницаИзмерения");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НоменклатураПлановая", "НоменклатураПлановая");
	Блокировка.Заблокировать();
	
	Для Каждого ТекСтрока Из ТаблицаЗаказыПоставщику Цикл
		ТекСтрока.СуммаУпр  = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
		    ДополнительныеСвойства.ВалютаДокумента,    ДополнительныеСвойства.ВалютаУпрУчета,
			ДополнительныеСвойства.КурсДокумента,      ДополнительныеСвойства.КурсУпр,
			ДополнительныеСвойства.КратностьДокумента, ДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
		
		ТекСтрока.СуммаРегл = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
			ДополнительныеСвойства.ВалютаДокумента,    ДополнительныеСвойства.ВалютаРеглУчета,
			ДополнительныеСвойства.КурсДокумента,      ДополнительныеСвойства.КурсРегл,
			ДополнительныеСвойства.КратностьДокумента, ДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
	КонецЦикла;
		
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыПоставщику", ТаблицаЗаказыПоставщику);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
	
КонецПроцедуры

Процедура ПодготовитьТаблицыТоваровПоОбеспечению(ТаблицаПланы, ТаблицаТовары, СвязанныеТовары) Экспорт
	
	СвязанныеТовары.Очистить();
	
	Для Каждого ТекСтрока Из ТаблицаПланы Цикл
		// Идентификаторы временные и не сохраняются, поэтому генерируются заново каждый раз
		ТекСтрока.ID = Строка(Новый УникальныйИдентификатор);
		ТекСтрока.КоличествоПоОбеспечению = 0;
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаТовары.Номенклатура КАК Справочник.Номенклатура) КАК НоменклатураТовара,
	|	ВЫРАЗИТЬ(ТаблицаТовары.Количество КАК ЧИСЛО) КАК Количество,
	|	ВЫРАЗИТЬ(ТаблицаТовары.НомерСтроки КАК ЧИСЛО) КАК НомерСтрокиТовара
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаПланы.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаПланы.КоличествоПоПлану КАК ЧИСЛО) КАК Количество,
	|	ВЫРАЗИТЬ(ТаблицаПланы.НомерСтроки КАК ЧИСЛО) КАК НомерСтрокиПлана,
	|	ВЫРАЗИТЬ(ТаблицаПланы.ID КАК СТРОКА) КАК ID
	|ПОМЕСТИТЬ втПланы
	|ИЗ
	|	&ТаблицаПланы КАК ТаблицаПланы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.НоменклатураТовара КАК НоменклатураТовара,
	|	втТовары.Количество КАК Количество,
	|	втТовары.НомерСтрокиТовара КАК НомерСтрокиТовара,
	|	втТовары.НоменклатураТовара КАК АналогТовара
	|ПОМЕСТИТЬ втТоварыСАналогами
	|ИЗ
	|	втТовары КАК втТовары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТовары.НоменклатураТовара,
	|	втТовары.Количество,
	|	втТовары.НомерСтрокиТовара,
	|	уатАналогиПрямые.Аналог
	|ИЗ
	|	втТовары КАК втТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатАналоги КАК уатАналогиПрямые
	|		ПО втТовары.НоменклатураТовара = уатАналогиПрямые.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТовары.НоменклатураТовара,
	|	втТовары.Количество,
	|	втТовары.НомерСтрокиТовара,
	|	уатАналогиОбратные.Номенклатура
	|ИЗ
	|	втТовары КАК втТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатАналоги КАК уатАналогиОбратные
	|		ПО втТовары.НоменклатураТовара = уатАналогиОбратные.Аналог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПланы.Номенклатура КАК Номенклатура,
	|	втПланы.Количество КАК Количество,
	|	втПланы.НомерСтрокиПлана КАК НомерСтрокиПлана,
	|	втПланы.ID КАК ID,
	|	втТоварыСАналогами.НомерСтрокиТовара КАК НомерСтрокиТовара,
	|	втТоварыСАналогами.НоменклатураТовара КАК НоменклатураТовара,
	|	втТоварыСАналогами.Количество КАК КоличествоАналога
	|ИЗ
	|	втПланы КАК втПланы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТоварыСАналогами КАК втТоварыСАналогами
	|		ПО втПланы.Номенклатура = втТоварыСАналогами.АналогТовара");
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
	Запрос.УстановитьПараметр("ТаблицаПланы", ТаблицаПланы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаПлана = ТаблицаПланы[Выборка.НомерСтрокиПлана-1];
		СтрокаТовара = ТаблицаТовары[Выборка.НомерСтрокиТовара-1];
		
		НоваяСтрока = СвязанныеТовары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.НоменклатураТовара;
		НоваяСтрока.ID = Выборка.ID;
		
		КоличествоПоОбеспечению = Мин(СтрокаТовара.Количество, СтрокаПлана.КоличествоПоПлану - СтрокаПлана.КоличествоПоОбеспечению);
		НоваяСтрока.Количество = КоличествоПоОбеспечению;
		СтрокаПлана.КоличествоПоОбеспечению = СтрокаПлана.КоличествоПоОбеспечению + КоличествоПоОбеспечению;
		СтрокаТовара.Количество = СтрокаТовара.Количество - КоличествоПоОбеспечению;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
